---
kind: property
id: P:Autodesk.Revit.DB.SweptBlend.PathSketch
source: html/413241cc-aef5-24cc-1348-9bc926ceb1e5.htm
---
# Autodesk.Revit.DB.SweptBlend.PathSketch Property

The sketched path for the swept blend.

## Syntax (C#)
```csharp
public Sketch PathSketch { get; }
```

## Remarks
If the swept blend is based on selected 3d curve, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .